import React from 'react'

export function TermsAndConditionsPage() {
  return (
    <div className="container mt-5"  style={{ fontFamily: "sans" }} dir="rtl">
      <h1 className="mb-4">قوانین و مقررات</h1>
      <h1>Create page in site</h1>
      <h2 className="mt-4">مقدمه</h2>
      <p>
        این سند شامل قوانین و مقررات استفاده از خدمات ما می‌باشد. با استفاده از خدمات ما، شما با این قوانین موافقت می‌کنید.
      </p>

      <h2 className="mt-4">شرایط عمومی</h2>
      <p>
        استفاده از خدمات ما مشروط به رعایت قوانین جمهوری اسلامی ایران و قوانین بین‌المللی است. هرگونه استفاده غیرقانونی یا مغایر با شئونات اسلامی ممنوع است.
      </p>

      <h2 className="mt-4">حریم خصوصی</h2>
      <p>
        ما به حریم خصوصی کاربران خود احترام می‌گذاریم. اطلاعات شخصی شما مطابق با سیاست حفظ حریم خصوصی ما استفاده خواهد شد.
      </p>

      <h2 className="mt-4">مسئولیت کاربران</h2>
      <p>
        کاربران مسئول حفظ اطلاعات حساب کاربری خود هستند و نباید این اطلاعات را در اختیار دیگران قرار دهند.
      </p>

      <h2 className="mt-4">تغییرات</h2>
      <p>
        ما ممکن است در هر زمان این قوانین را تغییر دهیم. تغییرات از زمان انتشار در وب‌سایت ما لازم‌الاجرا خواهند بود.
      </p>
    </div>
  )
} 